# <center>第5章 pandas入门</center>
- <center>数据结构</center>
- <center>基本功能</center>
- <center>汇总和计算描述</center>
- <center>处理数据缺失</center>
- <center>层次化索引</center>
- <center>其他关于pandas话题</center>

## 数据结构
- Series:类似于一维数组的对象
- DataFrame：是一个表格型的数据结构

**Series**

In [1]:
import pandas as pd;import numpy as np

In [2]:
obj = pd.Series([4,5,5,6])

In [3]:
obj

0    4
1    5
2    5
3    6
dtype: int64

In [4]:
obj.index
obj.values

array([4, 5, 5, 6], dtype=int64)

In [5]:
#指定index的Series？为什么index可以重复。
obj2 = pd.Series([4,7,3,5],index=['a','b','c','c'])

In [6]:
obj2['c']

c    3
c    5
dtype: int64

In [7]:
obj2['c'] =1

In [8]:
obj2

a    4
b    7
c    1
c    1
dtype: int64

In [9]:
#数组运算

In [10]:
obj2 * 2

a     8
b    14
c     2
c     2
dtype: int64

In [11]:
#布尔运算
obj2[obj2>2]

a    4
b    7
dtype: int64

In [12]:
#数学函数
np.exp(obj2)

a      54.598150
b    1096.633158
c       2.718282
c       2.718282
dtype: float64

In [13]:
#还可以吧Series看做一个定长的字典，因为它是索引值的一个映射
'b' in obj2

True

In [14]:
'e' in obj2

False

In [15]:
#进而可以将字典直接转换为Series
sdata = {'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}

In [16]:
obj3 = pd.Series(sdata)

In [17]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
np.exp(obj3)#inf无穷大

Ohio      inf
Texas     inf
Oregon    inf
Utah      inf
dtype: float64

In [19]:
states = ['Ohio','Texas','Oregon','Utah','WU']

In [20]:
obj4 = pd.Series(sdata,index =states)

In [21]:
obj4

Ohio      35000.0
Texas     71000.0
Oregon    16000.0
Utah       5000.0
WU            NaN
dtype: float64

In [22]:
pd.isnull(obj4)

Ohio      False
Texas     False
Oregon    False
Utah      False
WU         True
dtype: bool

In [23]:
pd.notnull(obj4)

Ohio       True
Texas      True
Oregon     True
Utah       True
WU        False
dtype: bool

In [24]:
#Series也有类似方法
obj4.isnull()

Ohio      False
Texas     False
Oregon    False
Utah      False
WU         True
dtype: bool

In [25]:
obj4.notnull()

Ohio       True
Texas      True
Oregon     True
Utah       True
WU        False
dtype: bool

In [26]:
# 数据对齐功能
obj3 + obj4

Ohio       70000.0
Oregon     32000.0
Texas     142000.0
Utah       10000.0
WU             NaN
dtype: float64

In [27]:
#Series对象及其索引都有属性，该功能跟pandas其他的关键功能关系非常密切

In [28]:
obj4.name = 'population'

In [29]:
obj4.index.name = 'sate'

In [30]:
obj4

sate
Ohio      35000.0
Texas     71000.0
Oregon    16000.0
Utah       5000.0
WU            NaN
Name: population, dtype: float64

In [31]:
#Series索引可以通过赋值的方式就地修改

In [32]:
obj4.index = 'a b c d c'.split()

In [33]:
obj4

a    35000.0
b    71000.0
c    16000.0
d     5000.0
c        NaN
Name: population, dtype: float64

**DataFrame**

In [34]:
#字典方式创建
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [35]:
frame = pd.DataFrame(data)

In [36]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [37]:
#如果指定了列顺序，则会按照指定排序
frame = pd.DataFrame(data,columns=['pop','year','state'])

In [38]:
frame

   pop  year   state
0  1.5  2000    Ohio
1  1.7  2001    Ohio
2  3.6  2002    Ohio
3  2.4  2001  Nevada
4  2.9  2002  Nevada

In [39]:
#与Series用字典创建的方式类似，重指定的列索引后，找不到会为空
frame2 = pd.DataFrame(data,columns=['pop','year','state','debt'],
                       index = ['one','two','there','four','five'])

In [40]:
frame2

       pop  year   state debt
one    1.5  2000    Ohio  NaN
two    1.7  2001    Ohio  NaN
there  3.6  2002    Ohio  NaN
four   2.4  2001  Nevada  NaN
five   2.9  2002  Nevada  NaN

In [41]:
frame2.columns

Index(['pop', 'year', 'state', 'debt'], dtype='object')

In [42]:
#通过类似字典标记的方式或是属性的方式，可以将df的列获取为一个Series

In [43]:
frame2['state']

one        Ohio
two        Ohio
there      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [307]:
#为什么获得整个表格
frame2.pop

<bound method NDFrame.pop of    Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   NaN    NaN         NaN
d   6.0    7.0         8.0>

In [45]:
#行也可以通过位置或名称方式进行获取
frame2.ix['one']

d:\Users\Amazing\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

pop       1.5
year     2000
state    Ohio
debt      NaN
Name: one, dtype: object

In [46]:
#列可以通过赋值的方式进行修改
frame2['debt']  =16.5

In [47]:
frame2

       pop  year   state  debt
one    1.5  2000    Ohio  16.5
two    1.7  2001    Ohio  16.5
there  3.6  2002    Ohio  16.5
four   2.4  2001  Nevada  16.5
five   2.9  2002  Nevada  16.5

In [48]:
#通过一组array获取
frame2['debt'] = np.arange(5.)

In [49]:
frame2

       pop  year   state  debt
one    1.5  2000    Ohio   0.0
two    1.7  2001    Ohio   1.0
there  3.6  2002    Ohio   2.0
four   2.4  2001  Nevada   3.0
five   2.9  2002  Nevada   4.0

In [50]:
#关键字del用于删除列
frame2['eastern'] = frame2.state  =='Ohio'

In [51]:
frame2

       pop  year   state  debt  eastern
one    1.5  2000    Ohio   0.0     True
two    1.7  2001    Ohio   1.0     True
there  3.6  2002    Ohio   2.0     True
four   2.4  2001  Nevada   3.0    False
five   2.9  2002  Nevada   4.0    False

In [52]:
#警告：就地删除
del frame2['eastern']

In [53]:
frame2

       pop  year   state  debt
one    1.5  2000    Ohio   0.0
two    1.7  2001    Ohio   1.0
there  3.6  2002    Ohio   2.0
four   2.4  2001  Nevada   3.0
five   2.9  2002  Nevada   4.0

- 由字典组成的字典
各内层字典会成为一列。键会被合并成结果的行索引，跟“由Series组成的字典”的情况一样

In [56]:
pop = {
        'Nevada':{2001:2.4,2002:2.9},
        'Ohio':{2000:1.5,2001:3.6}

}

In [57]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 3.6}}

In [58]:
frame3 = pd.DataFrame(pop)

In [59]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   3.6
2002     2.9   NaN

In [60]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   3.6   NaN

- 可以输出给DataFrame构造器的数据
1.ndarray
2.数组、元组、或列表组成的字典
3.Numpy构造化
4.Series组成的字典
5.字典组成的字典
6.字典或Series列表
7.另一个DataFrame

和Series一样，可以对索引进行设置

In [62]:
frame3.index.name = 'year'

In [63]:
frame3.columns.name = 'name'

In [64]:
frame3

name  Nevada  Ohio
year
2000     NaN   1.5
2001     2.4   3.6
2002     2.9   NaN

In [65]:
frame3.values

array([[nan, 1.5],
       [2.4, 3.6],
       [2.9, nan]])

In [67]:
#如果数据类型不同，数字类型的数据就会运用能兼容所的有数据类型
frame2.values

array([[1.5, 2000, 'Ohio', 0.0],
       [1.7, 2001, 'Ohio', 1.0],
       [3.6, 2002, 'Ohio', 2.0],
       [2.4, 2001, 'Nevada', 3.0],
       [2.9, 2002, 'Nevada', 4.0]], dtype=object)

- 索引对象
  -  index对象是不能被修改（安全共享）

In [68]:
obj  = pd.Series(range(3),index=['A','B','C'])

In [69]:
obj

A    0
B    1
C    2
dtype: int64

In [70]:
index = obj.index

**pandas中数据模型**
        -  index,最泛化的index对象，将轴标签表示为一个有Numpy对象组成的数组
        - int64index,针对整数的特殊index
        - Multilindex,层次化索引对象，表示单个轴上的多层索引。
        - DataTimeindex ,存在秒级时间戳
        - Periodindex,针对Period（时间间隔）的数据

In [74]:
'Ohio' in frame3.columns

True

In [77]:
2001 in frame3.index

True

- index方法和属性
   1.append,连接另一哥index对象
    2.diff,计算差集
    3.intersection
    4.union,计算并集
    5.isin
    6.delete
    7.drop
    8.insert
    9.is_monotonic 个元素均大于等于前一个元素时，返回TRUE
    10.is_unique 当index没有重复时，返回TRUE;
    11.UNIQUE 计算index中唯一值的数组

In [79]:
obj2

a    4
b    7
c    1
c    1
dtype: int64

In [86]:
obj

A    0
B    1
C    2
dtype: int64

In [91]:
obj.reindex(['T','H','J'],fill_value = 0)

T    0
H    0
J    0
dtype: int64

In [90]:
obj2

T    0
H    0
J    0
dtype: int64

In [94]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [95]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

**reindex方法** 
|参数|说明|
| --- | --- |
|fill或pad|前向填充|
|bfill或者backfill|后向填充|

In [100]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                      index = ['a','b','d'],
                      columns = ['Ohio','Texas','California'])

In [102]:
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
d     6      7           8

In [105]:
#为什么等于
frame2 = frame.reindex(['a','b','c','d'])

In [106]:
# 丢弃制定轴上的项

In [107]:
obj = pd.Series(np.arange(5.),index= ['a','b','c','d','e'])

In [108]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [109]:
obj.drop("a")

b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [110]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [113]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   NaN    NaN         NaN
d   6.0    7.0         8.0

In [116]:
#删除列方法
frame2.drop("Ohio",axis=1)

   Texas  California
a    1.0         2.0
b    4.0         5.0
c    NaN         NaN
d    7.0         8.0

- 索引、选取和过滤

In [117]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [118]:
obj['a']

0.0

In [119]:
obj[['a','b','c']]

a    0.0
b    1.0
c    2.0
dtype: float64

In [120]:
#利用标签进行切片于python切片不同，末端包含

In [121]:
obj["a":'b']

a    0.0
b    1.0
dtype: float64

In [122]:
#切片赋值方式
obj['a':'b'] = 5

In [123]:
obj

a    5.0
b    5.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [124]:
frame3

name  Nevada  Ohio
year
2000     NaN   1.5
2001     2.4   3.6
2002     2.9   NaN

In [128]:
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64', name='year')

In [132]:
frame3[frame3['Ohio']>2]

name  Nevada  Ohio
year
2001     2.4   3.6

In [135]:
#进行行索引的简单方式
frame3.ix[2001,'Ohio']

d:\Users\Amazing\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

3.6

In [136]:
frame3

name  Nevada  Ohio
year
2000     NaN   1.5
2001     2.4   3.6
2002     2.9   NaN

In [138]:
frame3[['Nevada','Ohio']]

name  Nevada  Ohio
year
2000     NaN   1.5
2001     2.4   3.6
2002     2.9   NaN

In [139]:
frame3.ix[:2002,'Ohio']

d:\Users\Amazing\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year
2000    1.5
2001    3.6
2002    NaN
Name: Ohio, dtype: float64

- DataFrame 索引选项
  1.obj[value]  选取单个列或者一组列，在一些特殊情况下会比较便利;布尔型数组过滤（过滤行）、切片（行切片）、布尔型数据框。
  2.obj.ix[value] 选取df的单个行或者一组行
  3.obj.ix[:,value] 需求单个列或者列子集
  4.obj.ix[value1,value2] 同时选取行和列
  5.reindx 方法，将一个或多个轴匹配到新的索引
  6.xs  方法，根据标签选取单行或单列，并返回一个Serise
  7.icol,irow 方法，根据整数位置选取单列或单行，并返回一个Serise
  8.get_value、set_valuesg 根据行标签和列标签需求单个值；

In [144]:
#2
frame3.ix[2001]

d:\Users\Amazing\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

name
Nevada    2.4
Ohio      3.6
Name: 2001, dtype: float64

In [149]:
#7 icol,irow
frame3.iloc[1]

name
Nevada    2.4
Ohio      3.6
Name: 2001, dtype: float64

In [157]:
s1 = pd.Series([6.2,4.5,6.3,2.1],index = ['a','b','c','d'])

In [159]:
s1

a    6.2
b    4.5
c    6.3
d    2.1
dtype: float64

In [160]:
s2 = pd.Series([-2.1,3.4,4.5,6],index = ['a','b','f','d'])

In [161]:
s2

a   -2.1
b    3.4
f    4.5
d    6.0
dtype: float64

In [162]:
s1 + s2

a    4.1
b    7.9
c    NaN
d    8.1
f    NaN
dtype: float64

## 在算术方法中填充值

In [164]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))

In [166]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [167]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [168]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [169]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [170]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [171]:
#测试
df2.add(df1,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [173]:
#在Serise或Dataframe中使用reset_index
#需要区分reindx 和reset_index
df1.reindex(columns= df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

- **灵活的算术方法**
add +
sub - 
div /
mul *


## DataFrame 和 Serise之间的运算

In [177]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [178]:
serise = frame.ix[0]

d:\Users\Amazing\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [179]:
serise

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

d:\Users\Amazing\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [186]:
frame - serise

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [187]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [188]:
# 函数的应用和映射

In [190]:
frame =pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.712796 -1.054638 -1.090861
Ohio   -1.361886 -0.273928 -1.810633
Texas   0.220346 -2.119742 -0.000335
Oregon  1.115240  1.240472 -1.016351

In [191]:
np.abs(frame)

               b         d         e
Utah    0.712796  1.054638  1.090861
Ohio    1.361886  0.273928  1.810633
Texas   0.220346  2.119742  0.000335
Oregon  1.115240  1.240472  1.016351

In [192]:
f = lambda x:x.max() - x.min()

In [193]:
frame.apply(f)

b    2.477125
d    3.360214
e    1.810297
dtype: float64

In [194]:
frame.apply(f,axis=1)

Utah      0.378065
Ohio      1.536705
Texas     2.340088
Oregon    2.256823
dtype: float64

In [195]:
#除了标量值外，传递给apply函数还可以返回由多个值组成的Serise

In [198]:
def f(x):
    return pd.Series([x.max(),x.min()],index=['max','min'])

In [199]:
frame.apply(f)

            b         d         e
max  1.115240  1.240472 -0.000335
min -1.361886 -2.119742 -1.810633

In [200]:
#applymap
f1 = lambda x:'%.2f' % x

In [201]:
frame.applymap(f1)

            b      d      e
Utah    -0.71  -1.05  -1.09
Ohio    -1.36  -0.27  -1.81
Texas    0.22  -2.12  -0.00
Oregon   1.12   1.24  -1.02

In [202]:
#排名和排序

In [203]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [204]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [205]:
#测试
obj.sort_values()

d    0
a    1
b    2
c    3
dtype: int64

In [207]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [208]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [210]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [212]:
# 测试
frame.sort_values(by= ['a','b'])

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [216]:
#带重复索引标签

**汇总和描述统计**

In [218]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], # np.nan产生NaN值
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [220]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [221]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [226]:
df.mean(axis=1,skipna =True)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [227]:
#返回间接统计

In [228]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [230]:
#返回最大位置
df.idxmax()

one    b
two    d
dtype: object

In [232]:
#一次新产生多个汇总
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [234]:
# 相关系数和协方差
import pandas_datareader.data as web # 需要安装pandas-datareader包

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker)

price =pd.DataFrame({tic: data['Adj Close']
                   for tic, data in all_data.iteritems()})
volume = pd.DataFrame({tic: data['Volume']
                    for tic, data in all_data.iteritems()})

AttributeError: 'dict' object has no attribute 'iteritems'

In [ ]:
#唯一值，值计数以及成员资格

In [235]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [236]:
#获取不重复值
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [238]:
#频数统计
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [239]:
#是否包含 isin
mask = obj.isin(['a','b'])

In [240]:
mask

0    False
1     True
2    False
3     True
4     True
5     True
6     True
7    False
8    False
dtype: bool

In [241]:
obj[mask]

1    a
3    a
4    a
5    b
6    b
dtype: object

**处理缺失值**

In [242]:
#判断是否拥有缺失值

In [243]:
string_data =pd.Series(['aardvark', 'artichoke', np.nan, 'avocado']) # np.nan创建缺失值
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [245]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [246]:
string_data[0] = None

In [247]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

- NA的处理方法
1.dropna
2.fillna
3.isnull
4.notnull

**滤除缺失值**

In [248]:
from numpy import  nan as NA

In [249]:
data = pd.Series([1,NA,3.5,NA,7])

In [250]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [251]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [252]:
#通过布尔型过滤
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

DataFrame过滤缺失数据

In [253]:
data =  pd.DataFrame([[1,6.5,3.],[1.,NA,NA],
                      [NA,NA,NA],[NA,6.5,3]
                     ]

                 )

In [254]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [255]:
cleaned = data.dropna()

In [256]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [257]:
#全为空才删除
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [258]:
#传入axis
data[4] = 0

In [259]:
data.dropna(how='all',axis=1)

     0    1    2  4
0  1.0  6.5  3.0  0
1  1.0  NaN  NaN  0
2  NaN  NaN  NaN  0
3  NaN  6.5  3.0  0

In [260]:
# 过滤行的问题
df  = pd.DataFrame(np.random.randn(7,3))

In [262]:
df.ix[:4,1] = NA

d:\Users\Amazing\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [264]:
df.ix[:2,2] = NA

d:\Users\Amazing\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [265]:
df

          0         1         2
0 -0.720970       NaN       NaN
1  0.539578       NaN       NaN
2  0.573768       NaN       NaN
3 -0.529877       NaN -1.338387
4  0.319597       NaN -0.521298
5 -0.104116  0.988059  1.433522
6  0.980561 -0.980477  2.200319

In [269]:
df.dropna(thresh=3)

          0         1         2
5 -0.104116  0.988059  1.433522
6  0.980561 -0.980477  2.200319

**填充缺失数据**

In [271]:
df.fillna(0)

          0         1         2
0 -0.720970  0.000000  0.000000
1  0.539578  0.000000  0.000000
2  0.573768  0.000000  0.000000
3 -0.529877  0.000000 -1.338387
4  0.319597  0.000000 -0.521298
5 -0.104116  0.988059  1.433522
6  0.980561 -0.980477  2.200319

In [272]:
#通过一个字典，对不同的列空值进行不同填充

In [275]:
df.fillna({1:.5,2:0})

          0         1         2
0 -0.720970  0.500000  0.000000
1  0.539578  0.500000  0.000000
2  0.573768  0.500000  0.000000
3 -0.529877  0.500000 -1.338387
4  0.319597  0.500000 -0.521298
5 -0.104116  0.988059  1.433522
6  0.980561 -0.980477  2.200319

In [276]:
#可以连续填充的最大数量limit

In [279]:
df.fillna(method='ffill',limit=2,inplace=True)

**fillna** 参数
1.value
2.method
3.axis
4.inplace
5.limit

**层次化索引**

In [280]:
data = pd.Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]]) # index是列表的列表，按照外层到内层的顺序，每层列表长度一样
data

a  1    0.318324
   2    2.467200
   3   -0.552621
b  1    0.543597
   2   -0.039284
   3    1.180285
c  1    1.287210
   2   -1.937965
d  2    2.056174
   3   -1.024973
dtype: float64

In [281]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [282]:
data[['a','b']]

a  1    0.318324
   2    2.467200
   3   -0.552621
b  1    0.543597
   2   -0.039284
   3    1.180285
dtype: float64

In [286]:
#在内层选取数据
data[:,2]

a    2.467200
b   -0.039284
c   -1.937965
d    2.056174
dtype: float64

In [287]:
data.unstack()

          1         2         3
a  0.318324  2.467200 -0.552621
b  0.543597 -0.039284  1.180285
c  1.287210 -1.937965       NaN
d       NaN  2.056174 -1.024973

In [289]:
data.unstack().stack()

a  1    0.318324
   2    2.467200
   3   -0.552621
b  1    0.543597
   2   -0.039284
   3    1.180285
c  1    1.287210
   2   -1.937965
d  2    2.056174
   3   -1.024973
dtype: float64

**重排分级顺序**
例如数据透视表中的行字段顺序

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [294]:
frame =pd.DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame.index.names = ['key1','key2']
frame.columns.names = ['state','color']

In [295]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [296]:
#交换index用key1和key2的位置

In [297]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [300]:
#同时结合排序函数sortlevel
frame.sortlevel(0,axis=1)

d:\Users\Amazing\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [301]:
#根据级别进行统计
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

**使用pandas的列**

In [302]:
frame =pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [303]:
#列名转换为行索引
frame.set_index(['c','d'])

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [305]:
#根据实际情况，选择是否保留
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [306]:
frame.reset_index()

   index  a  b    c  d
0      0  0  7  one  0
1      1  1  6  one  1
2      2  2  5  one  2
3      3  3  4  two  0
4      4  4  3  two  1
5      5  5  2  two  2
6      6  6  1  two  3